# UndefinedRooms Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..UndefinedRooms Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
There are undefined Rooms in the model! Recommend creating a Room schedule and checking the Area parameter of each Room for warnings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UndefinedRooms { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UndefinedRooms As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UndefinedRooms {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace